docs/behaviour_ontology.md
```mermaid
classDiagram 
   class Object~https://json-schema.org/draft/2020-12/schema~{
   } 
   class HealthIndication~behaviour~{
       HealthIndicationArgument anyType
       adaptionValueList string
       adaptionValueMileage string
       adaptionValueOperatingTime string
       adaptionValueTimestamp string
       adaptionValueVersion string
       classifiedLoadCollectiveChannels string
       classifiedLoadCollectiveClasses string
       classifiedLoadCollectiveComponentDescription string
       classifiedLoadCollectiveCountingMethod string
       classifiedLoadCollectiveCountingUnit string
       classifiedLoadCollectiveCountingValue string
       classifiedLoadCollectiveCounts string
       classifiedLoadCollectiveProjectDescription string
       requestComponentId string
   } 
   class HealthIndicatorResult~behaviour~{
       healthIndicatorValues Object
       indicatorVersion string
       responseComponentId string
   } 
   class PrognosisFunction~behaviour~{
       bodyClasses Object
       bodyCountsList Object
       headerChannels Object
       countingMethod string
       countingUnit string
       countingValue string
       observationType anyURI
   } 
   class RemainingUsefulLife~behaviour~{
       metadata Object
       notification Object
       RemainingUsefulLifeArgument anyType
       classification string
       recipient anyURI
       recipientConnector anyURI
       sender anyURI
       senderConnector anyURI
       severity string
       status string
       statusDate dateTime
       statusMileage int
       statusOperatingHours float
       targetDate dateTime
       timeStamp dateTime
   } 
   class RemainingUsefulLifeResult~behaviour~{
       remainingOperatingHours float
       remainingRunningDistance int
   } 
   class Function~function~{
   } 
   class Result~function~{
   } 
   class Part~vehicle~{
   } 
   PrognosisFunction --> Object : bodyClasses
   PrognosisFunction --> Object : bodyCountsList
   RemainingUsefulLife --> Part : component
   PrognosisFunction --> Object : headerChannels
   HealthIndicatorResult --> Object : healthIndicatorValues
   RemainingUsefulLife --> Object : metadata
   RemainingUsefulLife --> Object : notification
   HealthIndication --|> PrognosisFunction
   RemainingUsefulLife --|> PrognosisFunction
   HealthIndicatorResult --|> Result
   RemainingUsefulLifeResult --|> Result
   PrognosisFunction --|> Function

```  
